# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'cocoapods'
brew 'redis'
brew 'yarn'
brew 'chisel'
brew 'aria2'
brew 'php'
brew 'zplug'
brew 'pyenv'
brew 'ruby-build'
brew 'rbenv'
brew 'pyenv-virtualenv'
brew 'xcodesorg/made/xcodes'
brew 'raindropio'

# Apps
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'brave-browser'
cask 'insomnia'
cask 'slack'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'zoom'
cask 'teamviewer'
cask 'proxyman'
cask 'iterm2'
cask 'runjs'
cask 'qbittorrent'
cask 'rectangle'
cask 'sublime-merge'
cask 'google-chat'
cask 'fig'
cask 'postman'
cask 'kap'
cask 'shottr'
cask 'onedrive'
cask 'swiftformat-for-xcode'
cask 'skype'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'provisionql'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
mas 'Spark', id: 1176895641
mas 'InjectionIII', id: 1380446739
mas 'A Companion for SwiftUI', id: 1485436674